---
type: StairsPathType
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 12
tags: [revit-api, class]
---

# StairsPathType

`Autodesk.Revit.DB.Architecture.StairsPathType` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | ArrowheadTypeId | 2013 | `public ElementId ArrowheadTypeId { get ; set ; }` |
| Property | DistanceToCutMark | 2013 | `public double DistanceToCutMark { get ; set ; }` |
| Property | DrawForEachRun | 2013 | `public bool DrawForEachRun { get ; set ; }` |
| Property | EndAtRiser | 2013 | `public bool EndAtRiser { get ; set ; }` |
| Property | FullStepArrow | 2013 | `public bool FullStepArrow { get ; set ; }` |
| Property | LineShapeAtCorner | 2013 | `public StairsPathLineShapeAtCorner LineShapeAtCorner { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | ShowArrowheadToCutMark | 2013 | `public bool ShowArrowheadToCutMark { get ; set ; }` |
| Property | StairsPathDirection | 2013 | `public StairsPathDirection StairsPathDirection { get ; }` |
| Property | StartExtension | 2013 | `public double StartExtension { get ; set ; }` |
| Property | StartFromRiser | 2013 | `public bool StartFromRiser { get ; set ; }` |
| Property | StartSymbolTypeId | 2013 | `public ElementId StartSymbolTypeId { get ; set ; }` |